routes/web.php

    Route::get('/agents', AgentIndex::class)->name('agents.index');

    // Dashboard consultant (vue livewire/pages/dashboard.blade.php)
    Route::get('/dashboard', function () {
        return view('livewire.pages.dashboard', [
            'total_users'     => User::count(),
            'total_agents'    => Agent::where('is_active', true)->count(),
            'total_entities'  => Entity::count(),
            'total_fonctions' => Fonction::count(),
            'recent_agents'   => Agent::with(['entity', 'fonction'])
                                    ->where('is_active', true)
                                    ->latest()->take(5)->get(),
            'recent_users'    => User::latest()->take(5)->get(),
            'agents_inactifs' => Agent::where('is_active', false)->count(),
            'repartition'     => Entity::withCount([
                                    'agents' => fn($q) => $q->where('is_active', true)
                                 ])
                                   ->whereHas('agents', fn($q) => $q->where('is_active', true))
                                   ->orderByDesc('agents_count')
                                   ->get()
                                   ->map(fn($e) => (object)[
                                       'nom'       => $e->nom,
                                       'type'      => $e->type ?? 'direction',
                                       'nb_agents' => $e->agents_count,
                                   ]),
            'agents'          => Agent::with(['entity.parent', 'fonction'])
                                    ->where('is_active', true)->get(),
            'directions'      => Entity::whereNull('parent_uuid')
                                    ->where('is_active', true)->get(),
            'fonctions'       => Fonction::where('is_active', true)->get(),
---
select count(*) as aggregate from "users"
select count(*) as aggregate from "agents" where "is_active" = 1
select count(*) as aggregate from "entities"
select count(*) as aggregate from "fonctions"
select * from "agents" where "is_active" = 1 order by "created_at" desc limit 5
select * from "entities" where "entities"."id" in ('2e84cc9d-acfa-4236-843d-75cfe3562aae', '51f3c1ad-e848-4869-b4fe-ad5dfdca17b3', '6c2d9513-f072-42e1-835c-66a3d9c3c9d1')
select * from "fonctions" where "fonctions"."id" in ('747ab93b-ce6b-467f-afb4-c50995b4f262', '9f904f42-3fb2-49d1-bb91-1b971c6efadd', 'a5129895-a7ed-4f98-bc39-603680111bf7')
select * from "users" order by "created_at" desc limit 5
select count(*) as aggregate from "agents" where "is_active" = 0
select "entities".*, (select count(*) from "agents" where "entities"."id" = "agents"."entity_id" and "is_active" = 1) as "agents_count" from "entities" where exists (select * from "agents" where "entities"."id" = "agents"."entity_id" and "is_active" = 1) order by "agents_count" desc
select * from "agents" where "is_active" = 1
select * from "entities" where "entities"."id" in ('1f67ef8e-f660-48d4-8ed8-31e82ec8d1e8', '2e84cc9d-acfa-4236-843d-75cfe3562aae', '51f3c1ad-e848-4869-b4fe-ad5dfdca17b3', '6c2d9513-f072-42e1-835c-66a3d9c3c9d1')
select * from "fonctions" where "fonctions"."id" in ('6095d77c-98af-44db-b7a4-fb27cb9c7ea5', '747ab93b-ce6b-467f-afb4-c50995b4f262', '9f904f42-3fb2-49d1-bb91-1b971c6efadd', 'a5129895-a7ed-4f98-bc39-603680111bf7', 'beca8145-fe42-4de5-8fbc-dd2b56a6745a', 'e309357c-3ad6-4284-b4bc-4f65b46e7555', 'e5f48f23-11c1-4683-81c4-c6d2ee003426')
select * from "entities" where "parent_uuid" is null and "is_active" = 1
select * from "fonctions" where "is_active" = 1