app/Livewire/Admin/AgentManager.php

    public function loadDirections()
    {
        $this->directions = Entity::where('type', 'direction')
            ->where('is_active', true)
            ->orderBy('nom')
            ->get();
---
select * from "entities" where "type" = 'direction' and "is_active" = 1 order by "nom" asc

    public function loadServices()
    {
        if ($this->form['direction_id']) {
            $this->services = Entity::where('parent_id', $this->form['direction_id'])
                ->where('type', 'service')
                ->where('is_active', true)
                ->orderBy('nom')
                ->get();
---
select * from "entities" where "parent_id" = '51f3c1ad-e848-4869-b4fe-ad5dfdca17b3' and "type" = 'service' and "is_active" = 1 order by "nom" asc

    public function loadFonctions()
    {
        $this->fonctions = Fonction::where('is_active', true)
            ->orderBy('libelle')
            ->get();
---
select * from "fonctions" where "is_active" = 1 order by "libelle" asc

    public function generateMatricule()
    {
        if (!$this->editingAgent) {
            // Générer un matricule incrémenté : chiffre + lettre
            $lastAgent = Agent::orderBy('matricule', 'desc')->first();
---
select "matricule" from "agents" where "matricule" is not null

    public function saveAgent()
    {
        // Validation personnalisée pour l'email unique (ignore l'agent actuel)
        $rules = $this->rules;
        if ($this->editingAgent) {
            $rules['form.email'] = 'nullable|email|unique:agents,email,' . $this->editingAgent->id;
            $rules['form.matricule'] = 'required|string|max:20|unique:agents,matricule,' . $this->editingAgent->id;
        }

        $this->validate($rules, $this->messages);

        // Déterminer l'entité finale (service si sélectionné, sinon direction)
        $entityId = $this->form['service_id'] ?: $this->form['direction_id'];

        $agentData = [
            'matricule' => $this->form['matricule'],
            'nom' => $this->form['nom'],
            'prenom' => $this->form['prenom'],
            'email' => $this->form['email'],
            'telephone_professionnel' => $this->form['telephone_professionnel'],
            'telephone_prive' => $this->form['telephone_prive'],
            'entity_id' => $entityId,
            'fonction_id' => $this->form['fonction_id'],
            'bureau' => $this->form['bureau'],
            'date_prise_fonction' => $this->form['date_prise_fonction'],
            'is_active' => $this->form['is_active'],
        ];

        if ($this->editingAgent) {
            $this->editingAgent->update($agentData);
---
update "agents" set "date_prise_fonction" = '2026-02-09 00:00:00', "updated_at" = '2026-04-13 13:00:27' where "id" = 'a9c09991-0678-4b88-b463-357e40d2ee0b'

    public function deleteAgent(Agent $agent)
    {
        // Supprimer la photo si elle existe
        if ($agent->photo_url) {
            \Storage::disk('public')->delete($agent->photo_url);
        }

        // Supprimer l'utilisateur associé
        if ($agent->user) {
            $agent->user->delete();
        }

        $agent->delete();
---
delete from "agents" where "id" = '24e936b4-046e-4c99-8403-68ce910300c4'

    public function render()
    {
        $agents = Agent::query()
            ->with(['entity', 'fonction', 'user'])
            ->when($this->search, function ($q) {
                $q->where(function ($query) {
                    $query->where('nom', 'ILIKE', "%{$this->search}%")
                          ->orWhere('prenom', 'ILIKE', "%{$this->search}%")
                          ->orWhere('email', 'ILIKE', "%{$this->search}%")
                          ->orWhere('matricule', 'ILIKE', "%{$this->search}%");
                });
            })
            ->when($this->selectedEntity, function ($q) {
                $q->where('entity_id', $this->selectedEntity);
            })
            ->when($this->selectedFonction, function ($q) {
                $q->where('fonction_id', $this->selectedFonction);
            })
            ->when(!$this->showInactive, function ($q) {
                $q->where('is_active', true);
            })
            ->orderBy('nom')
            ->paginate(15);

        return view('livewire.admin.agent-manager', [
            'agents' => $agents,
            'allEntities' => Entity::where('is_active', true)->orderBy('nom')->get(),
            'allFonctions' => Fonction::where('is_active', true)->orderBy('libelle')->get(),
        ]);
---
select count(*) as aggregate from "agents" where ("nom"::text ILIKE '%MAT%' or "prenom"::text ILIKE '%MAT%' or "email"::text ILIKE '%MAT%' or "matricule"::text ILIKE '%MAT%') and "is_active" = 1
select * from "fonctions" where "is_active" = 1 order by "libelle" asc
select * from "entities" where "is_active" = 1 order by "nom" asc
select * from "agents" where ("nom"::text ILIKE '%MAT%' or "prenom"::text ILIKE '%MAT%' or "email"::text ILIKE '%MAT%' or "matricule"::text ILIKE '%MAT%') and "is_active" = 1 order by "nom" asc limit 15 offset 0
select * from "entities" where "entities"."id" in ('1f67ef8e-f660-48d4-8ed8-31e82ec8d1e8', '2e84cc9d-acfa-4236-843d-75cfe3562aae', '51f3c1ad-e848-4869-b4fe-ad5dfdca17b3', '6c2d9513-f072-42e1-835c-66a3d9c3c9d1')
select * from "fonctions" where "fonctions"."id" in ('6095d77c-98af-44db-b7a4-fb27cb9c7ea5', '747ab93b-ce6b-467f-afb4-c50995b4f262', '9f904f42-3fb2-49d1-bb91-1b971c6efadd', 'a5129895-a7ed-4f98-bc39-603680111bf7', 'beca8145-fe42-4de5-8fbc-dd2b56a6745a', 'e309357c-3ad6-4284-b4bc-4f65b46e7555', 'e5f48f23-11c1-4683-81c4-c6d2ee003426')
select * from "users" where "users"."agent_id" in ('00467c54-5450-4dc9-91d4-221a384e3298', '09e5b4dd-2b68-4a6b-8893-011a79b4b3ff', '24e936b4-046e-4c99-8403-68ce910300c4', '2e5d842f-4e97-4dcd-a277-48a53e32fe31', '348ea282-8b8d-4f74-b503-853778a9a972', '3e3e5208-21fd-41c7-bcb6-4ead7a35ced9', '580b5b85-0fca-4fb9-9e11-46b14efe4476', '614c292d-5908-484e-b982-bccdb8e0b194', '745ddae4-c660-469e-8726-f2f6777de820', '83018554-55f4-49fd-a3e7-0d3da7e813d3', '8abf40aa-e47f-432e-8b3f-17f6c61af096', 'a917e346-3ff8-4f5c-8c5c-fd9e29276d46', 'a9c09991-0678-4b88-b463-357e40d2ee0b', 'b19b197e-61f1-4b7c-943e-d104a44fe22c', 'c874d85d-a5c5-4dfb-ad43-1c598d2698a3')