app/Livewire/Admin/Dashboard.php

    public function render()
    {
        return view('livewire.admin.dashboard', [
            'total_users'    => User::count(),
            'total_agents'   => Agent::count(),
            'total_entities' => Entity::count(),
            'total_fonctions'=> Fonction::count(),
            'recent_users'   => User::latest()->take(5)->get(),
            'recent_agents'  => Agent::latest()->take(5)->get(),
            'allEntities'    => Entity::orderBy('nom')->get(),
            'fonctions'      => Fonction::orderBy('niveau')->get(),
        ]);
---
select count(*) as aggregate from "agents"
select count(*) as aggregate from "entities"
select count(*) as aggregate from "fonctions"
select count(*) as aggregate from "users"
select * from "users" order by "created_at" desc limit 5
select * from "agents" order by "created_at" desc limit 5
select * from "entities" order by "nom" asc
select * from "fonctions" order by "niveau" asc