app/Livewire/Admin/EntityHierarchyManager.php

            $this->editingEntity->update($this->form);
            session()->flash('message', 'Entité modifiée avec succès.');
        } else {
            Entity::create($this->form);
---
insert into "entities" ("nom", "type", "parent_id", "is_active", "id", "updated_at", "created_at") values ('Direction des Affaires Générales', 'direction', '', 1, '2b079e77-e8c1-4e4e-a574-f5f508ee3792', '2026-04-13 13:02:51', '2026-04-13 13:02:51')

    public function render()
    {
        // Récupérer toutes les entités organisées hiérarchiquement
        $directions = Entity::where('type', 'direction')
            ->with(['children' => function($q) {
                $q->with(['children'])->orderBy('nom');
            }])
            ->orderBy('nom')
            ->get();

        // Liste des entités pour les parents
        $availableParents = Entity::where('is_active', true)
            ->whereIn('type', ['direction', 'service'])
            ->orderBy('nom')
            ->get();
---
select * from "entities" where "type" = 'direction' order by "nom" asc
select * from "entities" where "is_active" = 1 and "type" in ('direction', 'service') order by "nom" asc