app/Livewire/Admin/FonctionManager.php

    public function getFonctionsProperty()
    {
        return Fonction::orderBy('libelle')->paginate(12);
---
select * from "fonctions" order by "libelle" asc limit 12 offset 0
select count(*) as aggregate from "fonctions"

    public function openEdit(string $id): void
    {
        $fonction = Fonction::findOrFail($id);
---
select * from "fonctions" where "fonctions"."id" = 'e5f48f23-11c1-4683-81c4-c6d2ee003426' limit 1

    public function save(): void
    {
        $this->validate();

        $data = [
            'libelle'     => $this->libelle,
            'niveau'      => $this->niveau,
            'description' => $this->description,
            'is_active'   => true,
        ];

        if ($this->fonctionId) {
            // Modification — le code est immuable
            Fonction::findOrFail($this->fonctionId)->update($data);
---
select * from "fonctions" where "fonctions"."id" = 'e5f48f23-11c1-4683-81c4-c6d2ee003426' limit 1
update "fonctions" set "description" = '', "niveau" = 2, "updated_at" = '2026-04-13 13:04:24' where "id" = 'e5f48f23-11c1-4683-81c4-c6d2ee003426'

    public function toggleActive(string $id): void
    {
        $fonction = Fonction::findOrFail($id);
---
select * from "fonctions" where "fonctions"."id" = 'e5f48f23-11c1-4683-81c4-c6d2ee003426' limit 1

    public function render()
    {
        return view('livewire.admin.fonction-manager', [
            'fonctions' => Fonction::orderBy('libelle')->get(),
        ]);
---
select * from "fonctions" order by "libelle" asc