app/Livewire/Annuaire/AgentIndex.php

select * from "entities" where "entities"."id" in ('2e84cc9d-acfa-4236-843d-75cfe3562aae', '51f3c1ad-e848-4869-b4fe-ad5dfdca17b3', '6c2d9513-f072-42e1-835c-66a3d9c3c9d1')
select * from "fonctions" where "fonctions"."id" in ('6095d77c-98af-44db-b7a4-fb27cb9c7ea5', '747ab93b-ce6b-467f-afb4-c50995b4f262', '9f904f42-3fb2-49d1-bb91-1b971c6efadd', 'a5129895-a7ed-4f98-bc39-603680111bf7', 'e5f48f23-11c1-4683-81c4-c6d2ee003426')
select * from "entities" where "is_active" = 1
select * from "fonctions" where "is_active" = 1
---
    public function render()
    {
        $agents = Agent::query()
            ->with(['entity', 'fonction'])

            // 🔍 Recherche
            ->when($this->search, function ($q) {
                $q->search($this->search);
            })

            // 🏢 Filtre entité
            ->when($this->entity_id, function ($q) {
                $q->where('entity_id', $this->entity_id);
            })

            // 🎯 Filtre fonction
            ->when($this->fonction_id, function ($q) {
                $q->where('fonction_id', $this->fonction_id);
            })

            // ✅ Statut
            ->when($this->is_active !== '', function ($q) {
                $q->where('is_active', $this->is_active);
            })

            ->latest()
            ->paginate(10);

        return view('livewire.annuaire.agent-index', [
            'agents'     => $agents,
            'entities'   => Entity::active()->get(),
            'fonctions'  => Fonction::where('is_active', true)->get(),