app/Livewire/Annuaire/DirectoryIndex.php

select * from "entities" where "type" = 'service' order by "nom" asc
---
    public function render()
    {
        return view('livewire.annuaire.directory-index', [
            'agents' => $this->agents,
            'fonctions' => $this->fonctions,
            'allEntities' => $this->allEntities,
            'entityTree' => $this->entityTree,
            'directions' => Entity::where('type','direction')->whereNull('parent_id')->orderBy('nom')->get(),
            'services' => Entity::where('type','service')->orderBy('nom')->get(),