app/Livewire/Annuaire/DirectoryIndex.php

select * from "agents" where exists (select * from "entities" where "agents"."entity_id" = "entities"."id" and ("parent_id" = '2e84cc9d-acfa-4236-843d-75cfe3562aae' or "id" = '2e84cc9d-acfa-4236-843d-75cfe3562aae')) and "entity_id" = '6c2d9513-f072-42e1-835c-66a3d9c3c9d1' and "fonction_id" = '6095d77c-98af-44db-b7a4-fb27cb9c7ea5' order by "nom" asc limit 24 offset 0
select count(*) as aggregate from "agents" where exists (select * from "entities" where "agents"."entity_id" = "entities"."id" and ("parent_id" = '2e84cc9d-acfa-4236-843d-75cfe3562aae' or "id" = '2e84cc9d-acfa-4236-843d-75cfe3562aae')) and "entity_id" = '6c2d9513-f072-42e1-835c-66a3d9c3c9d1' and "fonction_id" = '6095d77c-98af-44db-b7a4-fb27cb9c7ea5'
select * from "entities" where "entities"."id" in ('1f67ef8e-f660-48d4-8ed8-31e82ec8d1e8', '2e84cc9d-acfa-4236-843d-75cfe3562aae', '51f3c1ad-e848-4869-b4fe-ad5dfdca17b3', '6c2d9513-f072-42e1-835c-66a3d9c3c9d1')
select * from "fonctions" where "fonctions"."id" in ('6095d77c-98af-44db-b7a4-fb27cb9c7ea5', '747ab93b-ce6b-467f-afb4-c50995b4f262', 'a5129895-a7ed-4f98-bc39-603680111bf7', 'beca8145-fe42-4de5-8fbc-dd2b56a6745a', 'e309357c-3ad6-4284-b4bc-4f65b46e7555', 'e5f48f23-11c1-4683-81c4-c6d2ee003426')
---
    public function getAgentsProperty()
    {
        return Agent::query()
            ->with(['fonction', 'entity'])
            ->when($this->search, function ($q) {
                $q->where(function ($q2) {
                    $q2->where('nom', 'ilike', "%{$this->search}%")
                       ->orWhere('prenom', 'ilike', "%{$this->search}%")
                       ->orWhere('email', 'ilike', "%{$this->search}%")
                       ->orWhere('matricule', 'ilike', "%{$this->search}%");
                });
            })
            ->when($this->directionId, function ($q) {
                $q->whereHas('entity', function ($e) {
                    $e->where('parent_id', $this->directionId)
                      ->orWhere('id', $this->directionId);
                });
            })
            ->when($this->entityId, function ($q) {
                $q->where('entity_id', $this->entityId);
            })
            ->when($this->fonctionId, function ($q) {
                $q->where('fonction_id', $this->fonctionId);
            })
            ->orderBy('nom')
            ->paginate(24);

select * from "fonctions" where exists (select * from "agents" where "fonctions"."id" = "agents"."fonction_id" and exists (select * from "entities" where "agents"."entity_id" = "entities"."id" and ("parent_id" = '2e84cc9d-acfa-4236-843d-75cfe3562aae' or "id" = '2e84cc9d-acfa-4236-843d-75cfe3562aae'))) and exists (select * from "agents" where "fonctions"."id" = "agents"."fonction_id" and "entity_id" = '6c2d9513-f072-42e1-835c-66a3d9c3c9d1') order by "niveau" asc
---
    public function getFonctionsProperty()
    {
        return Fonction::when($this->directionId, function ($query) {
                $query->whereHas('agents.entity', function ($query) {
                    $query->where('parent_id', $this->directionId)
                          ->orWhere('id', $this->directionId);
                });
            })
            ->when($this->entityId, function ($query) {
                $query->whereHas('agents', function ($query) {
                    $query->where('entity_id', $this->entityId);
                });
            })
            ->orderBy('niveau')
            ->get();

select * from "entities" where "parent_id" = '2e84cc9d-acfa-4236-843d-75cfe3562aae' order by "nom" asc
select * from "entities" where "type" = 'service' order by "nom" asc
---
    public function getServicesProperty()
    {
        if ($this->directionId) {
            return Entity::where('parent_id', $this->directionId)
                         ->orderBy('nom')
                         ->get();
        }

        return Entity::where('type', 'service')
                     ->orderBy('nom')
                     ->get();

select * from "entities" order by "nom" asc
---
    public function getAllEntitiesProperty()
    {
        return Entity::orderBy('nom')->get();

select * from "entities" where "parent_id" is null
---
    public function getEntityTreeProperty()
    {
        return Entity::whereNull('parent_id')
            ->with('children.children')
            ->get();

select * from "agents" where "agents"."id" = 'a917e346-3ff8-4f5c-8c5c-fd9e29276d46' limit 1
select * from "entities" where "entities"."id" in ('6c2d9513-f072-42e1-835c-66a3d9c3c9d1')
select * from "fonctions" where "fonctions"."id" in ('a5129895-a7ed-4f98-bc39-603680111bf7')
---
    public function openDetail($id)
    {
        $this->selectedAgent = Agent::with(['fonction', 'entity.parent.parent'])->findOrFail($id);

select * from "entities" where "type" = 'service' order by "nom" asc
---
    public function save()
    {
        $this->validate();

        // Créer l'agent
        $agent = Agent::updateOrCreate(
            ['id' => $this->agentId],
            [
                'matricule' => $this->matricule,
                'nom' => $this->nom,
                'prenom' => $this->prenom,
                'email' => $this->email,
                'telephone' => $this->telephone,
                'telephone_interne' => $this->telephone_interne,
                'bureau' => $this->bureau,
                'date_prise_fonction' => $this->date_prise_fonction,
                'entity_id' => $this->entityId,
                'fonction_id' => $this->fonctionIdForm,
            ]
        );

select * from "entities" where "type" = 'direction' and "parent_id" is null order by "nom" asc
---
    public function render()
    {
        return view('livewire.annuaire.directory-index', [
            'agents' => $this->agents,
            'fonctions' => $this->fonctions,
            'allEntities' => $this->allEntities,
            'entityTree' => $this->entityTree,
            'directions' => Entity::where('type','direction')->whereNull('parent_id')->orderBy('nom')->get(),