app/Livewire/AgentProfile.php

update "users" set "password" = '$2y$12$xq0Im2kXVVV7yIu3Xt0fU.UXaLSwKzcoY/SUlT/JaBQQFfFVsEYsO', "updated_at" = '2026-04-13 10:46:48' where "uuid" = '0bc74885-bedd-4744-a2ec-45018da98dc7'
---

        // Mise à jour du mot de passe utilisateur si fourni
if (!empty($validated['password'])) {
    Auth::user()->update([
        'password' => Hash::make($validated['password']),
    ]);