app/Models/Fonction.php

select exists(select * from "agents" where "agents"."fonction_id" = 'e5f48f23-11c1-4683-81c4-c6d2ee003426' and "agents"."fonction_id" is not null and "is_active" = 1) as "exists"
---
    public function hasActiveAgents(): bool
    {
        return $this->agents()
                    ->where('is_active', true)
                    ->exists();